tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# cli ################################################################

# system
brew "zsh"
brew "git"
brew "vim"
brew "neovim"
brew "spaceship"
brew "fzf"
brew "tree"
brew "jq"
brew "watch"
brew "wireguard-go"
brew "wireguard-tools"

# alternatives
brew "exa"
brew "fd"
brew "the_silver_searcher"
brew "colordiff"
brew "tig"

# languages
brew "go"
brew "gopls"
brew "ruby-install"
brew "python@3.9"

# cli apps
brew "youtubedr"
brew "tarsnap"

# gui ################################################################

# menubar apps
cask "rectangle"
cask "hiddenbar"
cask "alt-tab"
cask "maccy"
cask "monitorcontrol"

# applications
cask "firefox"
cask "visual-studio-code"
cask "zoom"
cask "spotify"

# paid
cask "imazing"

# app store ##########################################################

brew "mas"

# apple
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "iMovie", id: 408981434

# system
mas "AdGuard for Safari", id: 1440147259
mas "WireGuard", id: 1451685025

# apps
mas "DaftCloud", id: 1320450034
mas "Gifski", id: 1351639930
mas "Slack", id: 803453959

# paid
mas "UTM", id: 1538878817
mas "Journey", id: 1455378681
mas "Acorn", id: 1547371478
mas "Monodraw", id: 920404675
mas "Byword", id: 420212497
mas "Tweetbot", id: 1384080005
mas "Reeder", id: 1529448980
mas "GoodLinks", id: 1474335294
mas "Noir", id: 1592917505
mas "Vinegar", id: 1591303229
