tap "homebrew/bundle"

# cli #########################################

# commands
brew "tree"
brew "jq"
brew "colordiff"
brew "ugrep"
brew "eza"
brew "fd"
brew "fzf"

# development
brew "neovim"
brew "tig"
brew "go"

# system
brew "htop"
brew "restic"
brew "lima"
brew "blocky"

# gui ##########################################

# applications
cask "rectangle"
cask "maccy"
cask "jordanbaird-ice"
cask "firefox"
cask "vscodium"
cask "ghostty"

# app store ####################################

brew "mas"

# apple
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
mas "Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "iMovie", id: 408981434

# system
mas "WireGuard", id: 1451685025

# paid
mas "Reeder", id: 1529448980
mas "Spect", id: 1409975750
mas "Simpletext", id: 1319340670

# apps
mas "Acorn", id: 6737921844
mas "WhatsApp", id: 310633997

# safari
mas "Wipr", id: 1662217862
mas "Vinegar", id: 1591303229
